app/controllers/posts_controller.rb

  def show
    if params[:author_id]
      author = Author.find_by(id: params[:author_id])
      if author.nil?
        redirect_to authors_path, alert: "Author not found."
      else
        @post = author.posts.find_by(id: params[:id])
---
SELECT  "authors".* FROM "authors" WHERE "authors"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."author_id" = ? AND "posts"."id" = ? LIMIT 1  [["author_id", 1], ["id", 1]]

  def new
    if params[:author_id] && !Author.exists?(params[:author_id])
---
SELECT "authors".* FROM "authors"

  def create
    @post = Post.new(post_params)
    @post.save
---
INSERT INTO "posts" ("title", "created_at", "updated_at", "author_id") VALUES (?, ?, ?, ?)  [["title", "Trying Post Again"], ["created_at", "2022-10-22 01:36:51.370896"], ["updated_at", "2022-10-22 01:36:51.370896"], ["author_id", 1]]